// напишите программу, которая на вход принимает число и выдает, является ли оно четным (делится ли оно на два без остатка)
/* 
4 -> да
-3 -> нет
7 -> нет */

Console.WriteLine("Hello, World!");
