// напишите программу, которая на вход принимает число(N), а на выходе показывает все четные числа от 1 до N
Console.WriteLine("Hello, World!");
