/* Задача 19. Напишите программу, которая принимает
на вход пятизначное число и проверяет, является ли оно 
палиндромом.
14212 -> нет
23432 -> да
12821 -> да */

Console.Clear();
Console.WriteLine("Введите пятизначное число: ");
int n = int.Parse(Console.ReadLine()!);

if (n % 10000 >1 && n > 9999)
{
    if (n / i %= 0);
    Console.Writline();
    count++;
}


